In [1]:
import jaydebeapi
import pandas as pd
from pandas import DataFrame
from sqlalchemy import create_engine

In [2]:
#Pulling data from AWS Redshift cloud data warehouse
conn = jaydebeapi.connect("com.amazon.redshift.jdbc.Driver",
                          "jdbc:redshift://pointb-rs.cnabkgbxqmuz.us-west-2.redshift.amazonaws.com:5439/dev",
                          {'user':"a201923", 'password':"1893WhiteCity"},
                          "/Users/asharifi/Desktop/PointB/RedshiftJDBC4-no-awssdk-1.2.36.1060.jar")

In [3]:
curs = conn.cursor()

In [33]:
array = []
curs.execute("select carrierdelay, flightdate, tailnum, carrier, flightnum, origin, dest from engineer.ontime where year = 2015 and carrier in ('AA', 'DL', 'WN', 'EV', 'UA') and depdelay > 0")
for rows in curs.fetchall():
    rows = list(rows)
    array.append(rows)

In [34]:
df1 = pd.DataFrame.from_records(array)

In [35]:
df1.head(4)

      0           1       2   3     4    5    6
0  28.0  2015-12-04  N553NW  DL  1258  ATL  JAX
1   NaN  2015-12-04  N924AT  DL  1292  ATL  TYS
2   9.0  2015-12-04  N895AT  DL  1381  HSV  ATL
3  17.0  2015-12-04  N926DH  DL  1544  MSP  STL

In [4]:
array = []
curs.execute("SELECT year, quarter, month FROM engineer.ontime limit 5")
for rows in curs.fetchall():
    rows = list(rows)
    array.append(rows)
    print(rows)

[2001, 4, 10]
[2001, 4, 12]
[2001, 4, 10]
[2001, 4, 12]
[2001, 4, 10]

In [6]:
df = pd.DataFrame.from_records(array)

In [7]:
df

      0  1   2
0  2001  4  10
1  2001  4  12
2  2001  4  10
3  2001  4  12
4  2001  4  10

In [8]:
df.columns = ['Year', "Month", "Day"]

In [9]:
df

   Year  Month  Day
0  2001      4   10
1  2001      4   12
2  2001      4   10
3  2001      4   12
4  2001      4   10

#target variable = carrierdelay
#descriptive: 
-IATA code by ArrDelayMinutes (heatmap)
-20 billion dollars (estimated cost of delays) divided by total minutes delayed = cost per minute
-average time delay over years (aggregate time delay by year)
-airline by time delay

#predictive: filter for a particular airline (trendline for estimated cost? or build a model?)
-what is their expected delay per IATA
-Total Predicted Cost

#prescriptive:
-what is the reason? departure delays, arrival delays
-maybe need more people loading items? How much would it cost us to hire a few more folks?
-how much money would that save us? estimate how much faster a plane would be loaded if we had +1 person.
-is it worth it?

#data that would help us:
-what if we knew how many people we had loading bags?
-what if we knew the reason for the delay?  Could be that a pilot was late or drunk?
--check cause of delay


#article that touches on delayed flights: https://mashable.com/2014/12/10/cost-of-delayed-flights/

In [4]:
from sqlalchemy import create_engine

In [5]:
conn1 = create_engine('postgresql://a201923:1893WhiteCity@pointb-rs.cnabkgbxqmuz.us-west-2.redshift.amazonaws.com:5439/dev')

In [12]:
#post to redshift
df.to_sql('test_table1', conn1, index=False, if_exists='replace')

In [13]:

array = []
curs.execute("SELECT carrierdelay, flightdate, tailnum, carrier, flightnum, origin, dest FROM engineer.ontime where year = 2015 limit 2000000")
for rows in curs.fetchall():
    rows = list(rows)
    array.append(rows)
df = pd.DataFrame.from_records(array)

In [14]:
#df.to_sql('ary_flights_2015_2', conn1, index=False, if_exists='replace')

In [15]:
df.head(4)

      0           1       2   3     4    5    6
0   NaN  2015-12-04  N375NC  DL  1208  BZN  SLC
1   NaN  2015-12-04  N953AT  DL  1228  JAN  ATL
2  28.0  2015-12-04  N553NW  DL  1258  ATL  JAX
3   NaN  2015-12-04  N967AT  DL  1279  ATL  DAL

In [16]:
#fast data processing: https://stackoverflow.com/questions/48018544/how-to-process-data-faster-in-python-from-redshift
#python to push data to bucket: https://stackoverflow.com/questions/40718637/how-do-i-upload-a-csv-file-in-mybucket-and-read-file-in-s3-aws-using-python

In [17]:
#carrierdelay, flightdate, tailnum, carrier, flightnum, origin, dest
df.columns = ['Carrier Delay', 'Flight Date', 'Tail Number', 'Carrier', 'Flight Number', 'Origin', 'Destination']

In [18]:
df.head(4)

,Carrier Delay,Flight Date,Tail Number,Carrier,Flight Number,Origin,Destination
0,NaN,2015-12-04,N375NC,DL,1208,BZN,SLC
1,NaN,2015-12-04,N953AT,DL,1228,JAN,ATL
2,28.0,2015-12-04,N553NW,DL,1258,ATL,JAX
3,NaN,2015-12-04,N967AT,DL,1279,ATL,DAL

In [19]:
#df.to_csv(r'/Users/asharifi/Desktop/pointb_flights.csv')

In [6]:
airports_df = pd.read_csv('/Users/asharifi/Desktop/PointB/airport-codes.csv')

In [7]:
airports_df_cleaned = airports_df[pd.notnull(airports_df['iata_code'])]

In [8]:
airport_code_sample = airports_df_cleaned.head(4)

In [19]:
airports_df_cleaned_dropped.size

45995

In [18]:
airports_df_cleaned_dropped = airports_df_cleaned.drop(['ident', 'type', 'elevation_ft', 'continent', 'iso_region', 'gps_code', 'local_code'],
                         axis = 1)

In [11]:
airports_df_cleaned.head(5)

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
223,03N,small_airport,Utirik Airport,4.0,OC,MH,MH-UTI,Utirik Island,K03N,UTK,03N,"169.852005, 11.222"
440,07FA,small_airport,Ocean Reef Club Airport,8.0,NaN,US,US-FL,Key Largo,07FA,OCA,07FA,"-80.274803161621, 25.325399398804"
594,0AK,small_airport,Pilot Station Airport,305.0,NaN,US,US-AK,Pilot Station,NaN,PQS,0AK,"-162.899994, 61.934601"
673,0CO2,small_airport,Crested Butte Airpark,8980.0,NaN,US,US-CO,Crested Butte,0CO2,CSE,0CO2,"-106.928341, 38.851918"
1088,0TE7,small_airport,LBJ Ranch Airport,1515.0,NaN,US,US-TX,Johnson City,0TE7,JCY,0TE7,"-98.62249755859999, 30.251800537100003"

In [20]:
airports_df_cleaned.to_sql('airport_codes', conn1, index=False, if_exists='replace')

In [50]:
airport_code_sample

,ident,type,name,elevation_ft,continent,iso_country,iso_region,municipality,gps_code,iata_code,local_code,coordinates
223,03N,small_airport,Utirik Airport,4.0,OC,MH,MH-UTI,Utirik Island,K03N,UTK,03N,"169.852005, 11.222"
440,07FA,small_airport,Ocean Reef Club Airport,8.0,NaN,US,US-FL,Key Largo,07FA,OCA,07FA,"-80.274803161621, 25.325399398804"
594,0AK,small_airport,Pilot Station Airport,305.0,NaN,US,US-AK,Pilot Station,NaN,PQS,0AK,"-162.899994, 61.934601"
673,0CO2,small_airport,Crested Butte Airpark,8980.0,NaN,US,US-CO,Crested Butte,0CO2,CSE,0CO2,"-106.928341, 38.851918"

In [51]:
df.size

14000000

In [52]:
df_sample = df.head(100000)

In [53]:
df_sample['origin_coordinates'] = ""

/Users/asharifi/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [54]:
df_sample.head(4)

,Carrier Delay,Flight Date,Tail Number,Carrier,Flight Number,Origin,Destination,coordinates
0,NaN,2015-12-04,N375NC,DL,1208,BZN,SLC,
1,NaN,2015-12-04,N953AT,DL,1228,JAN,ATL,
2,28.0,2015-12-04,N553NW,DL,1258,ATL,JAX,
3,NaN,2015-12-04,N967AT,DL,1279,ATL,DAL,